# Analysing Indian Cities using SQL in Jupyter Notebook

Analyzing data related to Indian cities encompassing vital demographics such as population, literacy rate, sex ratio, and the number of graduates offers valuable insights into the socio-economic landscape of urban areas across India. In this analysis, we will look at various indicators to get insights about the Indian cities.<br>
By looking at various indicators and information regarding Indian cities, we will look at answering the following questions.<br>
1. Finding the 5 most populous cities.<br>
2. Cities having literacy rates higher than 75%, sex ratio greater than 1000 and population greater than 5 Lakhs.<br>
3. States having literacy rates higher than 75% and sex ratio greater than 1000.<br>
4. Determine the 5 cities with the most significant gender disparity in literacy rates.<br>
5. Finding the gender disparity in literacy rates by zones.<br>
6. Determine the states with the highest gender disparity in total number of graduates.<br>
7. Find the top 2 states by population in each of the zones.

We will be using using Jupyter notebooks to query the data using SQL.

**The SQL code and keywords will have Python style color format.**

In [1]:
# Initializing SQL in Jupyter Notebook
%load_ext sql

Connecting to SQL database "indian_cities"

In [2]:
%sql postgresql://postgres:password@localhost/indian_cities

Looking at the data in both the tables

In [3]:
%%sql
-- Looking at the "cities" table
SELECT * FROM cities
LIMIT 5

 * postgresql://postgres:***@localhost/indian_cities
5 rows affected.

[(1, 'Abohar ', 'Punjab', 'Northern'),
 (2, 'Achalpur ', 'Maharashtra', 'Western'),
 (3, 'Adilabad ', 'Andhra Pradesh', 'Southern'),
 (4, 'Adityapur ', 'Jharkhand', 'Eastern'),
 (5, 'Adoni ', 'Andhra Pradesh', 'Southern')]

The "cities" table has the following columns:
1. city_id: Unique ID for each state.<br>
2. name: Name of the city.<br>
3. state: Name of the State.<br>
4. zone: Zonal Council to which the state of the city belongs.<br>

In [4]:
%%sql
-- Looking at the "indicators" table
SELECT * FROM indicators
LIMIT 5

 * postgresql://postgres:***@localhost/indian_cities
5 rows affected.

[(1, Decimal('145238'), Decimal('76840'), Decimal('68398'), Decimal('103319'), Decimal('58347'), Decimal('44972'), Decimal('890'), Decimal('79.86'), Decimal('16287'), Decimal('8612'), Decimal('7675')),
 (2, Decimal('112293'), Decimal('58256'), Decimal('54037'), Decimal('92433'), Decimal('49347'), Decimal('43086'), Decimal('928'), Decimal('91.99'), Decimal('8863'), Decimal('5269'), Decimal('3594')),
 (3, Decimal('117388'), Decimal('59232'), Decimal('58156'), Decimal('83955'), Decimal('46295'), Decimal('37660'), Decimal('982'), Decimal('80.51'), Decimal('10565'), Decimal('6797'), Decimal('3768')),
 (4, Decimal('173988'), Decimal('91495'), Decimal('82493'), Decimal('125985'), Decimal('71470'), Decimal('54515'), Decimal('902'), Decimal('83.46'), Decimal('19225'), Decimal('12189'), Decimal('7036')),
 (5, Decimal('166537'), Decimal('82743'), Decimal('83794'), Decimal('101292'), Decimal('56203'), Decimal('45089'), Decimal('1013'), Decimal('68.38'), Decimal('11902'), Decimal('7871'), Decimal('4031'))]

The "indicators" table has the following columns:
1. city_id: Unique ID for each state.<br>
2. pop_total: Total population of the city.<br>
3. pop_male: Total male population of the city.<br>
4. pop_female: Total female population of the city.<br>
5. literates_total: Total literate population.<br>
6. literates_male: Total literate male population.<br>
7. literates_female: Total female literate male population.<br>
8. sex_ratio: Number of females per 1000 male.<br>
9. literacy_rate: Literacy rate for the city.<br>
10. total_graduates: Total number of people having some graduation degree.<br>
11. male_graduates: Total number of males having some graduation degree.<br>
12. female_graduates: Total number of females having some graduation degree.<br>

**Checking for null values in both the tables**

In [5]:
%%sql
SELECT * FROM cities
WHERE city_id IS null
OR name IS NULL
OR state IS NULL
OR zone IS NULL

 * postgresql://postgres:***@localhost/indian_cities
0 rows affected.

[]

In [6]:
%%sql
SELECT * FROM indicators
WHERE city_id IS NULL
OR pop_total IS NULL
OR pop_female IS NULL
OR pop_male IS NULL
OR literates_total IS NULL
OR literates_male IS NULL
OR literates_female IS NULL
OR sex_ratio IS NULL
OR literacy_rate IS NULL
OR total_graduates IS NULL
OR male_graduates IS NULL
OR female_graduates IS NULL

 * postgresql://postgres:***@localhost/indian_cities
0 rows affected.

[]

## Query 1: Finding the 5 most populous cities

In [7]:
%%sql
SELECT cities.city_id, name, state, pop_total
FROM indicators
INNER JOIN cities
ON indicators.city_id=cities.city_id
ORDER BY pop_total DESC
LIMIT 5

 * postgresql://postgres:***@localhost/indian_cities
5 rows affected.

[(186, 'Greater Mumbai ', 'Maharashtra', Decimal('12478447')),
 (142, 'Delhi ', 'Nct Of Delhi', Decimal('11007835')),
 (73, 'Bengaluru', 'Karnataka', Decimal('8425970')),
 (185, 'Greater Hyderabad ', 'Andhra Pradesh', Decimal('6809970')),
 (8, 'Ahmadabad ', 'Gujarat', Decimal('5570585'))]

## Query 2: Cities having literacy rates higher than 75%, sex ratio greater than 1000 and population greater than 5 Lakhs.

In [8]:
%%sql
SELECT name AS city, pop_total, state, sex_ratio, literacy_rate
FROM indicators
INNER JOIN cities
ON indicators.city_id = cities.city_id
WHERE literacy_rate>75 AND sex_ratio>1000 AND pop_total>500000

 * postgresql://postgres:***@localhost/indian_cities
4 rows affected.

[('Guntur ', Decimal('651382'), 'Andhra Pradesh', Decimal('1016'), Decimal('81.11')),
 ('Kochi ', Decimal('601574'), 'Kerala', Decimal('1028'), Decimal('97.49')),
 ('Thiruvananthapuram ', Decimal('752490'), 'Kerala', Decimal('1064'), Decimal('93.72')),
 ('Tiruchirappalli ', Decimal('846915'), 'Tamil Nadu', Decimal('1025'), Decimal('91.32'))]

## Query 3: States having literacy rates higher than 75% and sex ratio greater than 1000

In [9]:
%%sql
WITH state_list (state, zone, pop_total, pop_female, pop_male, literates)
AS (SELECT state, zone, pop_total, pop_female, pop_male, literates_total
    FROM indicators
    INNER JOIN cities
    ON indicators.city_id = cities.city_id)
SELECT state, ROUND(SUM(pop_female)/SUM(pop_male)*1000,2) AS sex_ratio, ROUND(SUM(literates)/SUM(pop_total)*100,2) AS literacy_rate
FROM state_list
GROUP BY state 
HAVING ROUND(SUM(pop_female)/SUM(pop_male)*1000,2)>1000 AND ROUND(SUM(literates)/SUM(pop_total)*100,2)>75

 * postgresql://postgres:***@localhost/indian_cities
6 rows affected.

[('Puducherry', Decimal('1034.10'), Decimal('81.23')),
 ('Kerala', Decimal('1063.45'), Decimal('87.14')),
 ('Mizoram', Decimal('1029.32'), Decimal('86.90')),
 ('Manipur ', Decimal('1055.25'), Decimal('82.74')),
 ('Tripura', Decimal('1002.28'), Decimal('85.98')),
 ('Meghalaya', Decimal('1042.14'), Decimal('83.43'))]

## Query 4: Determine the 5 cities with the most significant gender disparity in literacy rates

**Gender disparity in total absolute terms**

In [10]:
%%sql
SELECT cities.city_id, cities.name, state, literates_male, literates_female,
(literates_male - literates_female) AS disparity
FROM indicators
INNER JOIN cities
ON indicators.city_id=cities.city_id
ORDER BY disparity DESC
LIMIT 5

 * postgresql://postgres:***@localhost/indian_cities
5 rows affected.

[(186, 'Greater Mumbai ', 'Maharashtra', Decimal('5727774'), Decimal('4509812'), Decimal('1217962')),
 (142, 'Delhi ', 'Nct Of Delhi', Decimal('4776490'), Decimal('3806615'), Decimal('969875')),
 (450, 'Surat ', 'Gujarat', Decimal('2082588'), Decimal('1416640'), Decimal('665948')),
 (73, 'Bengaluru', 'Karnataka', Decimal('3664959'), Decimal('3110983'), Decimal('553976')),
 (8, 'Ahmadabad ', 'Gujarat', Decimal('2459823'), Decimal('2004480'), Decimal('455343'))]

**Gender disparity as a percentage of total literate population**

In [11]:
%%sql
SELECT cities.city_id, cities.name, state, literates_male, literates_female, literates_total, 
ROUND((literates_male - literates_female)/literates_total*100,2) AS disparity_percent
FROM indicators
INNER JOIN cities
ON indicators.city_id=cities.city_id
ORDER BY disparity_percent DESC
LIMIT 5

 * postgresql://postgres:***@localhost/indian_cities
5 rows affected.

[(89, 'Bhiwadi ', 'Rajasthan', Decimal('44697'), Decimal('26290'), Decimal('70987'), Decimal('25.93')),
 (90, 'Bhiwandi ', 'Maharashtra', Decimal('314906'), Decimal('192816'), Decimal('507722'), Decimal('24.05')),
 (375, 'Pithampur ', 'Madhya Pradesh', Decimal('54030'), Decimal('33387'), Decimal('87417'), Decimal('23.61')),
 (40, 'Bagaha ', 'Bihar', Decimal('34751'), Decimal('22247'), Decimal('56998'), Decimal('21.94')),
 (143, 'Delhi Cantonment ', 'Nct Of Delhi', Decimal('57144'), Decimal('36827'), Decimal('93971'), Decimal('21.62'))]

## Query 5: Finding the gender disparity in literacy rates by zones

In [12]:
%%sql
WITH disparity (zone, literates_male, literates_female)
AS  (SELECT zone, literates_male, literates_female
    FROM indicators
    INNER JOIN cities
    ON indicators.city_id=cities.city_id)
SELECT zone, SUM(literates_male) AS literates_male, SUM(literates_female) AS literates_female,
(SUM(literates_male)-SUM(literates_female)) AS zonal_disparity
FROM disparity
GROUP BY zone
ORDER BY zonal_disparity DESC

 * postgresql://postgres:***@localhost/indian_cities
6 rows affected.

[('Western', Decimal('24716038'), Decimal('19952968'), Decimal('4763070')),
 ('Northern', Decimal('16306024'), Decimal('12686553'), Decimal('3619471')),
 ('Central', Decimal('16379602'), Decimal('13114086'), Decimal('3265516')),
 ('Eastern', Decimal('13643800'), Decimal('11419879'), Decimal('2223921')),
 ('Southern', Decimal('21212119'), Decimal('19035914'), Decimal('2176205')),
 ('North-Eastern', Decimal('1135568'), Decimal('1050744'), Decimal('84824'))]

## Query 6: Determine the states with the highest gender disparity in graduates

In [13]:
%%sql
WITH graduate_disparity (state, male_graduates, female_graduates, total_graduates)
AS (SELECT state, male_graduates, female_graduates, total_graduates
    FROM indicators
    INNER JOIN cities
    ON indicators.city_id=cities.city_id)
SELECT state, SUM(male_graduates) AS male_graduates, SUM(female_graduates) AS female_graduates, 
SUM(total_graduates) AS total_graduates,
ROUND((SUM(male_graduates) - SUM(female_graduates))/SUM(total_graduates)*100,2) AS state_disparity_percent
FROM graduate_disparity
GROUP BY state
ORDER BY state_disparity_percent DESC
LIMIT 5

 * postgresql://postgres:***@localhost/indian_cities
5 rows affected.

[('Bihar', Decimal('602353'), Decimal('287753'), Decimal('890106'), Decimal('35.34')),
 ('Jharkhand', Decimal('381444'), Decimal('230480'), Decimal('611924'), Decimal('24.67')),
 ('Orissa', Decimal('321969'), Decimal('208176'), Decimal('530145'), Decimal('21.46')),
 ('Andhra Pradesh', Decimal('1668337'), Decimal('1083014'), Decimal('2751351'), Decimal('21.27')),
 ('Rajasthan', Decimal('863826'), Decimal('583993'), Decimal('1447819'), Decimal('19.33'))]

## Query 7: Find the top 2 states by population in each of the zones.

In [14]:
%%sql
WITH rank_population (state, zone, population) 
AS (SELECT state, zone, SUM(pop_total) AS population,
    RANK() OVER (PARTITION BY zone ORDER BY SUM(pop_total) DESC) AS pop_rank
    FROM indicators
    INNER JOIN cities
    ON indicators.city_id = cities.city_id
    GROUP BY state, zone)
SELECT state, zone, population
FROM rank_population
WHERE pop_rank <= 2
ORDER BY zone, pop_rank

 * postgresql://postgres:***@localhost/indian_cities
12 rows affected.

[('Uttar Pradesh', 'Central', Decimal('25302925')),
 ('Madhya Pradesh', 'Central', Decimal('11023091')),
 ('West Bengal', 'Eastern', Decimal('18063509')),
 ('Bihar', 'Eastern', Decimal('6714516')),
 ('Assam', 'North-Eastern', Decimal('1391154')),
 ('Tripura', 'North-Eastern', Decimal('399688')),
 ('Nct Of Delhi', 'Northern', Decimal('13481997')),
 ('Rajasthan', 'Northern', Decimal('10443016')),
 ('Andhra Pradesh', 'Southern', Decimal('18171615')),
 ('Karnataka', 'Southern', Decimal('15799896')),
 ('Maharashtra', 'Western', Decimal('37722136')),
 ('Gujarat', 'Western', Decimal('17835049'))]